DELETE FROM cafe;
DELETE FROM users;
DELETE FROM user_roles;
DELETE FROM meals;
DELETE FROM vote;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO cafe (name) VALUES
  ('Взлет'),
  ('Звездочка'),
  ('Молодежное');

INSERT INTO users (name) VALUES
  ('Admin'),
  ('User1'),
  ('User2'),
  ('User3');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_ADMIN', 100003),
  ('ROLE_USER', 100004),
  ('ROLE_USER', 100005),
  ('ROLE_USER', 100006);

INSERT INTO meals (date_time, name, price, cafe_id) VALUES
  ('2015-05-21', 'Суп овощной', 90, 100000),
  ('2015-05-22', 'Суп гороховый', 90, 100000),
  ('2015-05-23', 'Борщ', 90, 100000),
  ('2015-05-21', 'Рассольник', 90, 100001),
  ('2015-05-22', 'Молочный суп', 90, 100001),
  ('2015-05-23', 'Грибной суп', 90, 100001),
  ('2015-05-21', 'Похлебка', 90, 100002),
  ('2015-05-22', 'Солянка', 90, 100002),
  ('2015-05-23', 'Рыбный суп', 90, 100002),
  ('2015-05-24', 'Суп с фрикадельками', 90, 100002),

  ('2015-05-21', 'Макароны с мясом', 70, 100000),
  ('2015-05-22', 'Картошка с мясом', 150, 100000),
  ('2015-05-23', 'Пицца', 80, 100000),
  ('2015-05-21', 'Тушеное мясо в горшочке', 80, 100001),
  ('2015-05-22', 'Куриное филе', 80, 100001),
  ('2015-05-23', 'Горбуша в духовке', 80, 100001),
  ('2015-05-21', 'Котлеты с гречей', 80, 100002),
  ('2015-05-22', 'Макароны с сосисками', 80, 100002),
  ('2015-05-23', 'Яичница', 80, 100002),
  ('2015-05-24', 'Пельмени', 80, 100002),

  ('2015-05-21', 'Морс', 50, 100000),
  ('2015-05-22', 'Какао', 50, 100000),
  ('2015-05-23', 'Молоко', 50, 100000),
  ('2015-05-21', 'Сбитень', 50, 100001),
  ('2015-05-22', 'Глинтвейн', 50, 100001),
  ('2015-05-23', 'Лимонад', 50, 100001),
  ('2015-05-21', 'Кисель', 50, 100002),
  ('2015-05-22', 'Чай', 50, 100002),
  ('2015-05-23', 'Сок', 60, 100002),
  ('2015-05-24', 'Кампот', 50, 100002);

INSERT INTO vote (user_id, cafe_id, date_time) VALUES
  (100000, 100011, '2015-05-31');
